In [32]:
import pandas as  pd
import numpy as np

In [22]:
#یک کتابخانه ایجاد کنیم کلا
df = pd.DataFrame(
    {
        "Name" : ["Hamid","ALi","Marzie"],
        "Age"  : [  22,    30,     18   ],
        "Sex"  : ["male","male","female"]
    }
)
(df.describe(include='number'))#for numberical data

             Age
count   3.000000
mean   23.333333
std     6.110101
min    18.000000
25%    20.000000
50%    22.000000
75%    26.000000
max    30.000000

In [68]:
#how to save dataframe:
#df.to_csv("mydf.csv")
#df.to_csv("mydf.csv",index=False) 
#index=False: It can be saved without an index.

In [23]:
(df.describe(include='all'))#for both numberical and textual data

         Name        Age   Sex
count       3   3.000000     3
unique      3        NaN     2
top     Hamid        NaN  male
freq        1        NaN     2
mean      NaN  23.333333   NaN
std       NaN   6.110101   NaN
min       NaN  18.000000   NaN
25%       NaN  20.000000   NaN
50%       NaN  22.000000   NaN
75%       NaN  26.000000   NaN
max       NaN  30.000000   NaN

In [24]:
df.describe() #summary description

             Age
count   3.000000
mean   23.333333
std     6.110101
min    18.000000
25%    20.000000
50%    22.000000
75%    26.000000
max    30.000000

In [25]:
(df["Name"])

0     Hamid
1       ALi
2    Marzie
Name: Name, dtype: object

In [26]:
df['Age'].max()

np.int64(30)

In [27]:
s = pd.Series(np.random.randn(10))
print(s,'\n----------')
(s[::2],'inew')

0    0.390084
1    1.564246
2   -0.755311
3    0.867541
4   -1.201954
5   -0.618286
6   -0.267076
7   -0.842480
8    2.007761
9   -0.133990
dtype: float64
----------

(0    0.390084
 2   -0.755311
 4   -1.201954
 6   -0.267076
 8    2.007761
 dtype: float64,
 'inew')

In [30]:
s.describe()

count    10.000000
mean      0.101054
std       1.078948
min      -1.201954
25%      -0.721055
50%      -0.200533
75%       0.748177
max       2.007761
dtype: float64

یک ستون بسازیم در حالت کلی:

In [31]:
a = pd.Series([34,23,56,34,30,47], name = "integer number")
a

0    34
1    23
2    56
3    34
4    30
5    47
Name: integer number, dtype: int64

next cell create : 10 row , 5 col , naming col                                                    
pd.DataFrame((import data),columns=[..])                                                          
np.random.randn(row,col)

In [48]:
d = pd.DataFrame(np.random.randn(10,5),columns=['a','b','c','d','e'])
d

          a         b         c         d         e
0  2.058235 -2.196569  0.124112 -0.841333 -0.766921
1  0.890418 -0.796793  0.909336  1.743509 -1.376147
2  0.224803  1.415668  0.260021  0.537448  0.288229
3  0.225893  1.022329 -1.718148  0.037916 -2.372856
4  0.349301 -0.502754 -0.264849  0.167943  0.644108
5  0.201291 -0.296261  0.014633  0.732652  1.471150
6  1.165892 -0.118076 -0.056228 -0.097349  1.301279
7 -0.414091 -1.334371 -0.205098  0.900643  0.119391
8  1.368845 -0.512432  1.270571 -1.761282 -0.154617
9  0.112500 -0.390381  0.089412 -1.025157  2.084133

In [56]:
d.idxmin(axis=1) # اندیس بزرگترین عدد رو در هر سطر بدست بیار

0    b
1    e
2    a
3    e
4    b
5    b
6    b
7    b
8    d
9    d
dtype: object

In [58]:
d.idxmin(axis=0)#اندیس  کمترین عدد رو در هر ستون بدست بیار

a    7
b    0
c    3
d    8
e    3
dtype: int64

In [51]:
d.describe()

               a          b          c          d          e
count  10.000000  10.000000  10.000000  10.000000  10.000000
mean    0.618309  -0.370964   0.042376   0.039499   0.123775
std     0.736914   1.037247   0.787536   1.030697   1.362046
min    -0.414091  -2.196569  -1.718148  -1.761282  -2.372856
25%     0.207169  -0.725703  -0.167881  -0.655337  -0.613845
50%     0.287597  -0.446568   0.052022   0.102929   0.203810
75%     1.097024  -0.162622   0.226044   0.683851   1.136986
max     2.058235   1.415668   1.270571   1.743509   2.084133

create col that have 'nan' value:

In [39]:
pd.Series(['a',np.nan,'a','a',30,'a','b','b',np.nan,'d',34])

0       a
1     NaN
2       a
3       a
4      30
5       a
6       b
7       b
8     NaN
9       d
10     34
dtype: object

In [43]:
a = pd.Series(np.random.randn(5))
a

0   -0.817116
1   -1.361754
2   -0.258303
3   -1.140997
4    1.065210
dtype: float64

argmin and argmax in numpy = idxmin and idxmax in pandas !

In [45]:
a.idxmax() #اندیس بزرگترین را برمیگرداند

4

In [47]:
a.idxmin() #اندیس کوچیک ترین را برمیگرداند

1